IDEA StatiCa Open Model
TimeAxis Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Time axis
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Concrete.TimeAxis
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class TimeAxis : OpenObject
Public Class TimeAxis
	Inherits OpenObject
public ref class TimeAxis : public OpenObject
The TimeAxis type exposes the following members.
Constructors
Name | Description
TimeAxis
 Constructor
Top
Properties
Name | Description
CreepTime
 time from which the creep is calculated
Times
 Times
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace